{
  "nodes": [
    {
      "op": "null", 
      "name": "input_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p0", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_multiply", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "3201090aef5dc021", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_multiply"
      }, 
      "inputs": [
        [
          0, 
          0, 
          0
        ], 
        [
          1, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p1", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_dnnl_main_0", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "func_name": "tvmgen_default_dnnl_main_0", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          2, 
          0, 
          0
        ], 
        [
          3, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape_nop", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "a1555666c1c99c37", 
        "flatten_data": "0", 
        "func_name": "__nop"
      }, 
      "inputs": [
        [
          4, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p2", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_dnnl_main_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "func_name": "tvmgen_default_dnnl_main_2", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          5, 
          0, 
          0
        ], 
        [
          6, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p3", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "25bb7bb511d81a38", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_add"
      }, 
      "inputs": [
        [
          7, 
          0, 
          0
        ], 
        [
          8, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_dnnl_main_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "func_name": "tvmgen_default_dnnl_main_4", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          9, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p4", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_multiply_1", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "063f5586da156ab8", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_multiply_1"
      }, 
      "inputs": [
        [
          10, 
          0, 
          0
        ], 
        [
          11, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p5", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_dnnl_main_5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "func_name": "tvmgen_default_dnnl_main_5", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          12, 
          0, 
          0
        ], 
        [
          13, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p6", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_dnnl_main_7", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "func_name": "tvmgen_default_dnnl_main_7", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          14, 
          0, 
          0
        ], 
        [
          15, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p7", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_1", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "13d97910934bd7da", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_add_1"
      }, 
      "inputs": [
        [
          16, 
          0, 
          0
        ], 
        [
          17, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_dnnl_main_9", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "func_name": "tvmgen_default_dnnl_main_9", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          18, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p8", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_multiply_2", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "a369c60e44d6b451", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_multiply_2"
      }, 
      "inputs": [
        [
          19, 
          0, 
          0
        ], 
        [
          20, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p9", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_dnnl_main_10", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "func_name": "tvmgen_default_dnnl_main_10", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          21, 
          0, 
          0
        ], 
        [
          22, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p10", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_dnnl_main_12", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "func_name": "tvmgen_default_dnnl_main_12", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          23, 
          0, 
          0
        ], 
        [
          24, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p11", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_2", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "928d72fc0911a20f", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_add_2"
      }, 
      "inputs": [
        [
          25, 
          0, 
          0
        ], 
        [
          26, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_dnnl_main_14", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "func_name": "tvmgen_default_dnnl_main_14", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          27, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p12", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_multiply_3", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "34efe9766efaa66c", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_multiply_3"
      }, 
      "inputs": [
        [
          28, 
          0, 
          0
        ], 
        [
          29, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p13", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_dnnl_main_15", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "func_name": "tvmgen_default_dnnl_main_15", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          30, 
          0, 
          0
        ], 
        [
          31, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p14", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_dnnl_main_17", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "func_name": "tvmgen_default_dnnl_main_17", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          32, 
          0, 
          0
        ], 
        [
          33, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p15", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_3", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "81451d15809d7aeb", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_add_3"
      }, 
      "inputs": [
        [
          34, 
          0, 
          0
        ], 
        [
          35, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_dnnl_main_19", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "func_name": "tvmgen_default_dnnl_main_19", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          36, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p16", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_multiply_4", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "e492c6dd32793515", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_multiply_4"
      }, 
      "inputs": [
        [
          37, 
          0, 
          0
        ], 
        [
          38, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p17", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_dnnl_main_20", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "func_name": "tvmgen_default_dnnl_main_20", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          39, 
          0, 
          0
        ], 
        [
          40, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p18", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_dnnl_main_22", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "func_name": "tvmgen_default_dnnl_main_22", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          41, 
          0, 
          0
        ], 
        [
          42, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p19", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_4", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "9d96f11836f48c29", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_add_4"
      }, 
      "inputs": [
        [
          43, 
          0, 
          0
        ], 
        [
          44, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_dnnl_main_24", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "func_name": "tvmgen_default_dnnl_main_24", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          45, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p20", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_multiply_5", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "cb368d08f9e99f0d", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_multiply_5"
      }, 
      "inputs": [
        [
          46, 
          0, 
          0
        ], 
        [
          47, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p21", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_dnnl_main_25", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "func_name": "tvmgen_default_dnnl_main_25", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          48, 
          0, 
          0
        ], 
        [
          49, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p22", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_dnnl_main_27", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "func_name": "tvmgen_default_dnnl_main_27", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          50, 
          0, 
          0
        ], 
        [
          51, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p23", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_5", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "c6e6b98ca7484a9c", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_add_5"
      }, 
      "inputs": [
        [
          52, 
          0, 
          0
        ], 
        [
          53, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_dnnl_main_29", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "func_name": "tvmgen_default_dnnl_main_29", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          54, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p24", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_multiply_6", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "1544e41548ea5d76", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_multiply_6"
      }, 
      "inputs": [
        [
          55, 
          0, 
          0
        ], 
        [
          56, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p25", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_dnnl_main_30", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "func_name": "tvmgen_default_dnnl_main_30", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          57, 
          0, 
          0
        ], 
        [
          58, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p26", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_dnnl_main_32", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "func_name": "tvmgen_default_dnnl_main_32", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          59, 
          0, 
          0
        ], 
        [
          60, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p27", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_6", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "01af7ec2530a6c3b", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_add_6"
      }, 
      "inputs": [
        [
          61, 
          0, 
          0
        ], 
        [
          62, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_dnnl_main_34", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "func_name": "tvmgen_default_dnnl_main_34", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          63, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p28", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_multiply_7", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "b04add1e2d62d641", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_multiply_7"
      }, 
      "inputs": [
        [
          64, 
          0, 
          0
        ], 
        [
          65, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p29", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_dnnl_main_35", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "func_name": "tvmgen_default_dnnl_main_35", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          66, 
          0, 
          0
        ], 
        [
          67, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p30", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_dnnl_main_37", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "func_name": "tvmgen_default_dnnl_main_37", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          68, 
          0, 
          0
        ], 
        [
          69, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p31", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_61", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "01af7ec2530a6c3b", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_add_6"
      }, 
      "inputs": [
        [
          70, 
          0, 
          0
        ], 
        [
          71, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_dnnl_main_39", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "func_name": "tvmgen_default_dnnl_main_39", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          72, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p32", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_multiply_71", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "b04add1e2d62d641", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_multiply_7"
      }, 
      "inputs": [
        [
          73, 
          0, 
          0
        ], 
        [
          74, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p33", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_dnnl_main_40", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "func_name": "tvmgen_default_dnnl_main_40", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          75, 
          0, 
          0
        ], 
        [
          76, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape_nop", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "9ee9eba594ffcd25", 
        "flatten_data": "0", 
        "func_name": "__nop"
      }, 
      "inputs": [
        [
          77, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p34", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_dnnl_main_42", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "func_name": "tvmgen_default_dnnl_main_42", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          78, 
          0, 
          0
        ], 
        [
          79, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p35", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_7", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "1aeb30fbd70e0b19", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_add_7"
      }, 
      "inputs": [
        [
          80, 
          0, 
          0
        ], 
        [
          81, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_dnnl_main_44", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "func_name": "tvmgen_default_dnnl_main_44", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          82, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape_nop", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "31d8a7d5b254ba5c", 
        "flatten_data": "0", 
        "func_name": "__nop"
      }, 
      "inputs": [
        [
          83, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p36", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_dnnl_main_45", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "func_name": "tvmgen_default_dnnl_main_45", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          84, 
          0, 
          0
        ], 
        [
          85, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p37", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_sigmoid", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "a52df1bfd3cf710b", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_add_sigmoid"
      }, 
      "inputs": [
        [
          86, 
          0, 
          0
        ], 
        [
          87, 
          0, 
          0
        ]
      ]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    3, 
    6, 
    8, 
    11, 
    13, 
    15, 
    17, 
    20, 
    22, 
    24, 
    26, 
    29, 
    31, 
    33, 
    35, 
    38, 
    40, 
    42, 
    44, 
    47, 
    49, 
    51, 
    53, 
    56, 
    58, 
    60, 
    62, 
    65, 
    67, 
    69, 
    71, 
    74, 
    76, 
    79, 
    81, 
    85, 
    87
  ], 
  "heads": [
    [
      88, 
      0, 
      0
    ]
  ], 
  "attrs": {
    "dltype": [
      "list_str", 
      [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32"
      ]
    ], 
    "shape": [
      "list_shape", 
      [
        [1, 99, 12], 
        [1], 
        [1, 99, 12], 
        [1], 
        [1, 99, 12], 
        [1, 99, 12, 1], 
        [3, 3, 1, 54], 
        [1, 50, 6, 54], 
        [54], 
        [1, 50, 6, 54], 
        [1, 50, 6, 54], 
        [54], 
        [1, 50, 6, 54], 
        [54], 
        [1, 50, 6, 54], 
        [3, 3, 54, 54], 
        [1, 25, 3, 54], 
        [54], 
        [1, 25, 3, 54], 
        [1, 25, 3, 54], 
        [54], 
        [1, 25, 3, 54], 
        [54], 
        [1, 25, 3, 54], 
        [3, 3, 54, 55], 
        [1, 13, 2, 55], 
        [55], 
        [1, 13, 2, 55], 
        [1, 13, 2, 55], 
        [55], 
        [1, 13, 2, 55], 
        [55], 
        [1, 13, 2, 55], 
        [3, 3, 55, 55], 
        [1, 7, 1, 55], 
        [55], 
        [1, 7, 1, 55], 
        [1, 7, 1, 55], 
        [55], 
        [1, 7, 1, 55], 
        [55], 
        [1, 7, 1, 55], 
        [3, 3, 55, 56], 
        [1, 4, 1, 56], 
        [56], 
        [1, 4, 1, 56], 
        [1, 4, 1, 56], 
        [56], 
        [1, 4, 1, 56], 
        [56], 
        [1, 4, 1, 56], 
        [3, 3, 56, 56], 
        [1, 2, 1, 56], 
        [56], 
        [1, 2, 1, 56], 
        [1, 2, 1, 56], 
        [56], 
        [1, 2, 1, 56], 
        [56], 
        [1, 2, 1, 56], 
        [3, 3, 56, 57], 
        [1, 1, 1, 57], 
        [57], 
        [1, 1, 1, 57], 
        [1, 1, 1, 57], 
        [57], 
        [1, 1, 1, 57], 
        [57], 
        [1, 1, 1, 57], 
        [3, 3, 57, 57], 
        [1, 1, 1, 57], 
        [57], 
        [1, 1, 1, 57], 
        [1, 1, 1, 57], 
        [57], 
        [1, 1, 1, 57], 
        [57], 
        [1, 1, 1, 57], 
        [1, 57], 
        [128, 57], 
        [1, 128], 
        [128], 
        [1, 128], 
        [1, 128], 
        [1, 128], 
        [1, 128], 
        [1, 1], 
        [1], 
        [1, 1]
      ]
    ], 
    "storage_id": [
      "list_int", 
      [
        0, 
        1, 
        2, 
        3, 
        4, 
        4, 
        5, 
        2, 
        6, 
        4, 
        2, 
        7, 
        4, 
        8, 
        2, 
        9, 
        4, 
        10, 
        2, 
        4, 
        11, 
        2, 
        12, 
        4, 
        13, 
        2, 
        14, 
        4, 
        2, 
        15, 
        4, 
        16, 
        2, 
        17, 
        18, 
        19, 
        20, 
        18, 
        21, 
        20, 
        22, 
        18, 
        23, 
        20, 
        24, 
        18, 
        20, 
        25, 
        18, 
        26, 
        20, 
        27, 
        18, 
        28, 
        20, 
        18, 
        29, 
        20, 
        30, 
        18, 
        31, 
        20, 
        32, 
        18, 
        20, 
        33, 
        18, 
        34, 
        20, 
        35, 
        18, 
        36, 
        20, 
        18, 
        37, 
        20, 
        38, 
        18, 
        18, 
        39, 
        20, 
        40, 
        18, 
        20, 
        20, 
        41, 
        42, 
        43, 
        44
      ]
    ]
  }, 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89
  ]
}