{
  "nodes": [
    {
      "op": "null", 
      "name": "input_1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p1", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_multiply_add_reshape_layout_transform", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "src_layout": "NHWC", 
        "hash": "edf73d0b38a76e33", 
        "dst_layout": "NCHW", 
        "func_name": "tvmgen_default_fused_multiply_add_reshape_layout_transform", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          0, 
          0, 
          0
        ], 
        [
          1, 
          0, 
          0
        ], 
        [
          2, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p2", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_dnnl_main_0", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "func_name": "tvmgen_default_dnnl_main_0", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          3, 
          0, 
          0
        ], 
        [
          4, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p3", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p4", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p5", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_nn_relu_multiply_add", 
      "attrs": {
        "num_inputs": "4", 
        "num_outputs": "1", 
        "hash": "2e3beb9aac8d9f99", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_add_nn_relu_multiply_add"
      }, 
      "inputs": [
        [
          5, 
          0, 
          0
        ], 
        [
          6, 
          0, 
          0
        ], 
        [
          7, 
          0, 
          0
        ], 
        [
          8, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p6", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_dnnl_main_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "func_name": "tvmgen_default_dnnl_main_2", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          9, 
          0, 
          0
        ], 
        [
          10, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p7", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p8", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p9", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_nn_relu_multiply_add_1", 
      "attrs": {
        "num_inputs": "4", 
        "num_outputs": "1", 
        "hash": "499cb1b31810e660", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_add_nn_relu_multiply_add_1"
      }, 
      "inputs": [
        [
          11, 
          0, 
          0
        ], 
        [
          12, 
          0, 
          0
        ], 
        [
          13, 
          0, 
          0
        ], 
        [
          14, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p10", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_dnnl_main_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "func_name": "tvmgen_default_dnnl_main_4", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          15, 
          0, 
          0
        ], 
        [
          16, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p11", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p12", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p13", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_nn_relu_multiply_add_2", 
      "attrs": {
        "num_inputs": "4", 
        "num_outputs": "1", 
        "hash": "416b83608a075f26", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_add_nn_relu_multiply_add_2"
      }, 
      "inputs": [
        [
          17, 
          0, 
          0
        ], 
        [
          18, 
          0, 
          0
        ], 
        [
          19, 
          0, 
          0
        ], 
        [
          20, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p14", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_dnnl_main_6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "func_name": "tvmgen_default_dnnl_main_6", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          21, 
          0, 
          0
        ], 
        [
          22, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p15", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p16", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p17", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_nn_relu_multiply_add_3", 
      "attrs": {
        "num_inputs": "4", 
        "num_outputs": "1", 
        "hash": "bf49741f75d3eb89", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_add_nn_relu_multiply_add_3"
      }, 
      "inputs": [
        [
          23, 
          0, 
          0
        ], 
        [
          24, 
          0, 
          0
        ], 
        [
          25, 
          0, 
          0
        ], 
        [
          26, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p18", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_dnnl_main_8", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "func_name": "tvmgen_default_dnnl_main_8", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          27, 
          0, 
          0
        ], 
        [
          28, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p19", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p20", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p21", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_nn_relu_multiply_add_4", 
      "attrs": {
        "num_inputs": "4", 
        "num_outputs": "1", 
        "hash": "4c0793d24a6b24bb", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_add_nn_relu_multiply_add_4"
      }, 
      "inputs": [
        [
          29, 
          0, 
          0
        ], 
        [
          30, 
          0, 
          0
        ], 
        [
          31, 
          0, 
          0
        ], 
        [
          32, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p22", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_dnnl_main_10", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "func_name": "tvmgen_default_dnnl_main_10", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          33, 
          0, 
          0
        ], 
        [
          34, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p23", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p24", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p25", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_nn_relu_multiply_add_5", 
      "attrs": {
        "num_inputs": "4", 
        "num_outputs": "1", 
        "hash": "4f2d56021e5f8790", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_add_nn_relu_multiply_add_5"
      }, 
      "inputs": [
        [
          35, 
          0, 
          0
        ], 
        [
          36, 
          0, 
          0
        ], 
        [
          37, 
          0, 
          0
        ], 
        [
          38, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p26", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_dnnl_main_12", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "func_name": "tvmgen_default_dnnl_main_12", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          39, 
          0, 
          0
        ], 
        [
          40, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p27", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p28", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p29", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_nn_relu_multiply_add_6", 
      "attrs": {
        "num_inputs": "4", 
        "num_outputs": "1", 
        "hash": "57859e1592872563", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_add_nn_relu_multiply_add_6"
      }, 
      "inputs": [
        [
          41, 
          0, 
          0
        ], 
        [
          42, 
          0, 
          0
        ], 
        [
          43, 
          0, 
          0
        ], 
        [
          44, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p30", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_dnnl_main_14", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "func_name": "tvmgen_default_dnnl_main_14", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          45, 
          0, 
          0
        ], 
        [
          46, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p31", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p32", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p33", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_nn_relu_multiply_add_layout_transform_reshape", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "4", 
        "src_layout": "NCHW", 
        "hash": "ff2759ca7d4ebd56", 
        "dst_layout": "NHWC", 
        "func_name": "tvmgen_default_fused_add_nn_relu_multiply_add_layout_transform_reshape", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          47, 
          0, 
          0
        ], 
        [
          48, 
          0, 
          0
        ], 
        [
          49, 
          0, 
          0
        ], 
        [
          50, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p34", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_dnnl_main_16", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "func_name": "tvmgen_default_dnnl_main_16", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          51, 
          0, 
          0
        ], 
        [
          52, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p35", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_nn_relu_reshape", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "2f32a40bcfc984e9", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_add_nn_relu_reshape"
      }, 
      "inputs": [
        [
          53, 
          0, 
          0
        ], 
        [
          54, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p36", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_dnnl_main_18", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "func_name": "tvmgen_default_dnnl_main_18", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          55, 
          0, 
          0
        ], 
        [
          56, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p37", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_add_sigmoid", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "a52df1bfd3cf710b", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_add_sigmoid"
      }, 
      "inputs": [
        [
          57, 
          0, 
          0
        ], 
        [
          58, 
          0, 
          0
        ]
      ]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    4, 
    6, 
    7, 
    8, 
    10, 
    12, 
    13, 
    14, 
    16, 
    18, 
    19, 
    20, 
    22, 
    24, 
    25, 
    26, 
    28, 
    30, 
    31, 
    32, 
    34, 
    36, 
    37, 
    38, 
    40, 
    42, 
    43, 
    44, 
    46, 
    48, 
    49, 
    50, 
    52, 
    54, 
    56, 
    58
  ], 
  "heads": [
    [
      59, 
      0, 
      0
    ]
  ], 
  "attrs": {
    "dltype": [
      "list_str", 
      [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32"
      ]
    ], 
    "shape": [
      "list_shape", 
      [
        [1, 99, 12], 
        [1], 
        [1], 
        [1, 1, 99, 12], 
        [54, 1, 3, 3], 
        [1, 54, 50, 6], 
        [1, 54, 1, 1], 
        [1, 54, 1, 1], 
        [1, 54, 1, 1], 
        [1, 54, 50, 6], 
        [54, 54, 3, 3], 
        [1, 54, 25, 3], 
        [1, 54, 1, 1], 
        [1, 54, 1, 1], 
        [1, 54, 1, 1], 
        [1, 54, 25, 3], 
        [55, 54, 3, 3], 
        [1, 55, 13, 2], 
        [1, 55, 1, 1], 
        [1, 55, 1, 1], 
        [1, 55, 1, 1], 
        [1, 55, 13, 2], 
        [55, 55, 3, 3], 
        [1, 55, 7, 1], 
        [1, 55, 1, 1], 
        [1, 55, 1, 1], 
        [1, 55, 1, 1], 
        [1, 55, 7, 1], 
        [56, 55, 3, 3], 
        [1, 56, 4, 1], 
        [1, 56, 1, 1], 
        [1, 56, 1, 1], 
        [1, 56, 1, 1], 
        [1, 56, 4, 1], 
        [56, 56, 3, 3], 
        [1, 56, 2, 1], 
        [1, 56, 1, 1], 
        [1, 56, 1, 1], 
        [1, 56, 1, 1], 
        [1, 56, 2, 1], 
        [57, 56, 3, 3], 
        [1, 57, 1, 1], 
        [1, 57, 1, 1], 
        [1, 57, 1, 1], 
        [1, 57, 1, 1], 
        [1, 57, 1, 1], 
        [57, 57, 3, 3], 
        [1, 57, 1, 1], 
        [1, 57, 1, 1], 
        [1, 57, 1, 1], 
        [1, 57, 1, 1], 
        [1, 57], 
        [128, 57], 
        [1, 128], 
        [128], 
        [1, 128], 
        [1, 128], 
        [1, 1], 
        [1], 
        [1, 1]
      ]
    ], 
    "storage_id": [
      "list_int", 
      [
        0, 
        1, 
        2, 
        3, 
        4, 
        5, 
        6, 
        7, 
        8, 
        3, 
        9, 
        5, 
        10, 
        11, 
        12, 
        3, 
        13, 
        5, 
        14, 
        15, 
        16, 
        3, 
        17, 
        18, 
        19, 
        20, 
        21, 
        22, 
        23, 
        18, 
        24, 
        25, 
        26, 
        22, 
        27, 
        18, 
        28, 
        29, 
        30, 
        22, 
        31, 
        18, 
        32, 
        33, 
        34, 
        22, 
        35, 
        18, 
        36, 
        37, 
        38, 
        22, 
        39, 
        18, 
        40, 
        22, 
        41, 
        42, 
        43, 
        44
      ]
    ]
  }, 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60
  ]
}